In [1]:
from pyspark.sql import SparkSession

In [2]:
spark = SparkSession.builder \
    .master("local[1]") \
    .appName("SparkByExamples.com") \
    .getOrCreate()

In [3]:
dataList = [("Java", 20000), ("Python", 100000), ("Scala", 3000)]
rdd = spark.sparkContext.parallelize(dataList)

In [10]:
print(rdd.collect())

[('Java', 20000), ('Python', 100000), ('Scala', 3000)]

In [7]:
rdd2 = spark.sparkContext.textFile(r"C:\Users\pmboc\Downloads\SQL Coding Challeng Q1.txt")

In [9]:
print(rdd2.collect())

[' ', '', '', 'CREATE TABLE employee (', '         employee_id INT PRIMARY KEY,', '         first_name VARCHAR(50),', '         last_name VARCHAR(50),', '         department VARCHAR(50),', '         salary DECIMAL(10, 2)', '     );', '', '', 'INSERT INTO employee (employee_id, first_name, last_name, department, salary)', '     VALUES', "         (1, 'Pradip', 'Bochare', 'IT', 60000.00),", "         (2, 'Vedant', 'Joshi', 'HR', 55000.00),", "         (3, 'Vinay', 'Natkar', 'Finance', 70000.00),", "         (4, 'Vikrant', 'Pachbhai', 'Marketing', 62000.00),", "         (5, 'Abhishek', 'Zune', 'IT', 58000.00);", '', '', '   SELECT', '         employee_id,', '         first_name,', '         last_name,', '         department,', '         salary,', '         SUM(salary) OVER (PARTITION BY department) AS department_total_salary,', '         AVG(salary) OVER () AS overall_avg_salary', '     FROM', '         employee;', '', '', '   SELECT', '         department,', '         SUM(salary) AS department_total_salary,', '         AVG(salary) AS department_avg_salary', '     FROM', '         employee', '     GROUP BY', '         department', '     WITH ROLLUP;', '', '']